Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Если исходное строковое значение равно null (с учётом регистра), то целевая переменная получает пустое значение независимо от её типа данных.
en: If the source string value is equal to null (case-sensitive), the target variable will get the null value irrespective of its data type.

source: Если какие-то связи уже есть, то они остаются без изменения.
en: If some links are already available, they are left unchanged.

source: Если класс включает несколько категорий, то в метке перечисляются все категории, вошедшие в класс.
en: If the class includes several categories, it is required to list all categories included into the class in the caption.

source: Если классификация уверенная и класс-«победитель» имеет вероятность, значительно превышающую вероятности остальных классов, индекс Джини будет близок к 1.
en: If classification is stable, and the "winning" class has probability significantly higher than probabilities of other classes, the Gini index will be close to 1.

source: Если количество кластеров известно, то применяется алгоритм k-means, в противном случае — g-means, который определяет это количество автоматически в рамках заданного интервала.
en: If the number of clusters is known, k-means algorithm is used, otherwise, g-means algorithm is used. It enables to define this number automatically within the set interval.

source: Если количество строк в группе не кратно количеству строк в исходном наборе, размер последней группы окажется меньше.
en: If the row count in the group is not in multiples of the row count in the source data set, the latter group will have smaller size.

source: Если левая ось отсутствует, то настройка сетки не осуществляется.
en: If there is no left axis, the grid is not configured.

source: Если логин не указан, то используется доменная авторизация.
en: If the login is not specified, the domain authorization is used.

source: Если механизмом автосинхронизации уже созданы необходимые поля/переменные из подаваемых в порт данных, то необходимо отредактировать любой из параметров (Имя, Метку, Назначение и т.д.) всех необходимых полей/переменных.
en: If the required fields/variables have been already created by the automapping mechanism from the data supplied to the port, it is required to edit any of the following parameters (Name, Caption, Usage type, etc.) of all required fields/variables.

source: Если набор данных имеет более 50 полей, то в визуализаторе Быстрый просмотр данных для табличного порта будут отображены только первые 50.
en: If the data set includes more than 50 fields, only the first 50 will be displayed for the table port in Quick View of Data visualizer.

source: Если настраивается входной порт принимающий переменные, список "Выходные" отображает значения переменных.
en: If it is required to configure the input port that accepts variables, the "Output" list displays the variables values.

source: Если начальная точка не задана, то степень регуляризации подбирается методом "золотого сечения", в противном случае - методом "схождения к вершине".
en: If the starting point is not set, the decay degree is selected using the "golden section search" method, otherwise, the "hill climbing" method is used.

source: Если начальное значение регуляризации не было задано, оно подбирается методом "золотого сечения".
en: If the initial decay value is not set, it is selected using the "golden section search" method.

source: Если не выбран ни один узел или выбрано несколько узлов, то в Инспекторе свойств будет приглашение "Выделите узел, чтобы посмотреть его свойства".
en: If no node was selected, or several nodes were selected, the following invitation will be in the Property inspector: "Select a node to view its properties".

source: Если не загружена XSD схема (не выполнялось действие "Загрузить из XSD...") или загруженное дерево не содержит рекурсивных узлов то кнопка скрыта/неактивна.
en: If the XSD schema has not been loaded ("Load from XSD..." operation has not been performed), or the loaded tree does not include recursive nodes, the button is concealed/inactive.

source: Если не задана начальная структура, то она подбирается в два этапа: сначала происходит выбор количества скрытых слоев (0, 1 или 2), затем, если результат предыдущего этапа не 0, грубо подбирается размер скрытых слоев методом "золотого сечения", причем для 2 скрытых слоев количество нейронов на данном этапе делается одинаковым;
en: If the initial structure is not set, it is selected in two stages. First, the number of hidden layers is selected (0, 1 or 2), then, the size of hidden layers is approximately selected using the "golden section search" method if the previous stage result is not equl to 0. In this case, the number of neurons for 2 hidden layers becomes the same at this stage.

source: Если не указан флаг "Заменять все", то будет заменено только первое вхождение заменяемой подстроки.
en: If "Replace all" flag is not stated, then only the first occurrence of the replaced substring will be replaced.

source: Если не указан флаг "Игнорировать регистр", то поиск заменяемых фрагментов будет регистрозависимым .
en: If "Ignore case" flag is not stated, then a search for the replaced fragments will be case sensitive.

source: Если необходим автоподбор структуры и регуляризации:
en: If autofit of structure and decay is required:

source: Если необходимо подобрать только степень регуляризации для заданной структуры:
en: If it is required to select only the decay degree for the set structure:

source: Если необходимо подобрать только структуру, не изменяя степень регуляризации
en: If it is required to select only the structure without changing the decay degree.

source: Если обучающее и тестовое множество не согласуются друг с другом по количеству записей (в сумме дают количество строк больше строк входного набора), то первым формируется множество согласно флагу Приоритет тестового множества, второе множество формируется по остаточному принципу.
en: If the training and test sets do not match each other by the number of records (in total they provide the row count that exceeds the input data set rows), the first set is generated according to Test set priority checkbox, whereas the second set is generated by the residual model.

source: Если пакет не сохранен, то относительный путь к внешнему модулю указывается от каталога пользователя.
en: If the package is not saved, the relative path to the external module is specified from the user directory.

source: Если пакет сохранен, то относительный путь к внешнему модулю указывается от расположения пакета.
en: If the package is saved, the relative path to the external module is specified from the package location.

source: Если параметр Port/Shared Memory пустой, то этот параметр можно оставить пустым, в таком случае будут показаны все доступные базы данных.
en: If Port/Shared Memory parameter is null, it is allowed to leave this parameter null, in this case all available databases will be shown.

source: Если параметр не указан, то выполняются все узлы Пакета, для которых заданы необходимые настройки режима активации.
en: If the parameter is not specified, all Package nodes for which the required settings of the activation mode are set must be executed.

source: Если параметр не указан, то используется пользователь по умолчанию.
en: If the parameter is not specified, the default user is used.

source: Если параметр не указан, то используется пустой пароль.
en: If the parameter is not specified, the empty password is used.

source: Если параметр не указан, то пакет запускается в режиме «Выполнение».
en: If the parameter is not specified, the package is launched in the "Execution" mode.

source: Если параметр пустой и ServerName не localhost, то подключение проходит по протоколу TCP/IP с портом по умолчанию 3306.
en: If the parameter is null, and ServerName is not localhost, connection is provided via TCP/IP protocol with default port 3306.

source: Если параметр пустой, то по умолчанию используется 1433.
en: If the parameter is null, 1433 is used by default.

source: Если параметр равен нулю, то таймаут не ограничен.
en: If this parameter is equal to 0, timeout is not limited.

source: Если параметры подключения к LDAP серверу настроены неправильно, то будет сообщение об ошибке с указанием имени добавляемого пользователя, иначе будет информационное сообщение, что пользователь добавлен:
en: If the LDAP server connection parameters are incorrectly set, the error message with the name of the added user will appear. Otherwise, the information message will notify that the user has been added:

source: Если переменная будет содержать значение: Номенклатура.Артикул = "4561", то результирующий запрос будет иметь вид:
en: If the variable will contain the following value: Nomenclature.ProductItem = "4561", the resulting request will have the following form:

source: Если пользователь найден и у него установлен способ аутентификации "LDAP" или же пользователь не найден, то проводится попытка Аутентификации через LDAP сервер.
en: If the user has been found, and the "LDAP" authentification method has been set for him, or no user has been found, Authentification attempt is made using the LDAP server.

source: Если пользователь уже есть в Loginom:
en: If the user is in Loginom:

source: Если пользователя нет в Loginom:
en: If the user is not in Loginom:

source: Если порядок полей менялся, его можно восстановить до исходного.
en: If the fields order was changed, it can be restored to the initial one.

source: Если последовательность обнаружена, то значение заменяется на новое.
en: If the sequence is detected, the value is replaced with the new one.

source: Если правая ось отсутствует, то настройка сетки не осуществляется.
en: If there is no right axis, the grid is not configured.

source: Если при включенной автосинхронизации удалить связь порта с источником данных, то ранее созданные из данных поля/переменные будут удалены из порта механизмом автосинхронизации как временные, актуальные только для конкретных данных.
en: If the port link with the data source is deleted when automapping is enabled, the fields/variables that have been earlier created from the data will be deleted from the port by the automapping mechanism as the temporary ones that are relevant only to the specific data.

source: Если применяется Метод разгруппировки: С учетом временных колебаний и сезонности опорных данных, то в эту таблицу добавляются также следующие поля:
en: If Ungrouping method is used: Given time variations and seasonality of the reference data is used, the following fields are also added to this table:

source: Если проект сохранен, то текущим каталогом для процесса, запускаемого узлом Выполнение программы, считается текущий каталог пакета.
en: If the project has been saved, the current package directory is considered to be the current directory for the process started by the Program execution node.

source: Если процесс обучения необходимо ограничить по времени, в этом случае он остановится после заданного количества эпох, даже если обучение еще не пришло к оптимальной точке, т.е. не достигнут порог минимального изменения весов.
en: If it is required to limit the training process in time, in this case, it will be stopped upon the set number of epochs even if the training has not reached the optimal point, namely, the minimum weight change threshold has not been reached yet.

source: Если путь начинается с "/", то он интерпретируется как абсолютный внутри файлового хранилища и считается от каталога пользователя.
en: If the path starts from "/", it is interpreted as the absolute one inside the file storage, and it is calculated from the user directory.

source: Если связь между полем и объектом была установлена неправильно, ее можно удалить, нажав на кнопку на линии связи.
en: If the link between the field and object has been incorrectly established, it can be deleted by pressing button in the line.

source: Если соединяемые наборы данных имеют разное количество записей, то результирующий набор может содержать пустые значения.
en: If the joined data sets have different number of records, the resulting data set can contain null values.

source: Если сопоставление отсутствует, то задействуется алгоритм CROSS JOIN соединения.
en: If there is no mapping, the CROSS JOIN algorithm of join is used.

source: Если среди них не найдено записей, удовлетворяющих условию фильтрации, выводится предупреждение Достигнуто максимальное количество строк сканирования: 1000.
en: If no records that meet the filtering criterion are detected among them, the following warning is shown: Maximum scanned row count reached: 1000.

source: Если структура входных данных известна, то в интерфейсе настройки порта можно задать структуру выходных данных порта и сопоставить поля (или переменные) входного набора порта с выходным.
en: If the input data structure is known, the port configuration interface enables to set the output data structure of the port and map the fields (or variables) of the input data set of the port with the output one.

source: Если существуют одинаковые значения, то содержащие их строки сортируются по второму в очереди полю сортировки и т.д.
en: If there are the same values, the strings that contain them are sorted by the second sort field, etc.

source: Если такое совпадение находится, то оно заменяется на значение поля Замена.
en: If such match is found, it is replaced with the value of the Replace field.

source: Если у параметра Заменять остальное выбрать пункт На регулярное выражение, то для значений, не найденных при помощи таблицы замен, используется зарезервированное обозначение $1.
en: If With regular expression option of Replace other parameter is selected, reserved $1 character is used for the values not detected using the replacement table.

source: Если узел соединен с другим узлом, то он является родительским, а связанный с ним узел — дочерним.
en: If the root is connected with another root, it is a parent root, and the connected root is called a chid root.

source: Если указанный день месяца больше, чем последний день месяца получившегося квартала , то функция устанавливает дату на последний день месяца получившегося квартала.
en: If the specified day of the month exceeds the last day of the month of the resulting quarter, the function will set the date to the last day of the month of the resulting quarter.

source: Если указанный день месяца больше, чем последний день получившегося месяца, то функция устанавливает дату на последний день получившегося месяца.
en: If the specified day of the month exceeds the last day of the resulting month, the function will set the date to the last day of the resulting month.

source: Если флаг "Заменять все" имеет значение False (ложь), то в возвращаемой строке будет заменено только первое по порядку вхождение.
en: If "Replace all" flag has the False (false) meaning, then only the first in order occurrence will be replaced in the returned string.

source: Если флаг "Заменять все" имеет значение True (истина), то в возвращаемой строке будут заменены все вхождения Старого Шаблона на Новый шаблон.
en: If "Replace all" flag has the True (true) meaning, then all occurrences of the Old template will be replaced with the New template in the returned string.

source: Если флаг "Игнорировать регистр" имеет значение False (ложь), то поиск заменяемых фрагментов (Старый шаблон) будет регистрозависимым.
en: If "Ignore case" flag has the False (false) meaning, then a search for the replaced fragments (the Old template) will be case sensitive.

source: Если флаг "Игнорировать регистр" имеет значение True (истина), то поиск заменяемых фрагментов (Старый шаблон) будет регистронезависимым.
en: If "Ignore case" flag has the True (true) meaning, then a search for the replaced fragments (the Old template) will be case insensitive.

source: Если флаг активен, зависимости нет.
en: If the checkbox is active, there is no dependence.

source: Если флаг неактивен, то значение верхней границы интервала относится к следующему интервалу (т.е. включается в него в качестве нижней границы).
en: If the checkbox is inactive, the upper bin bound value relates to the next bin (namely, it is included into it as the lower bound).

source: Если флаг установлен, то результрующая таблица из предыдущего примера будет выглядеть следующим образом:
en: If the checkbox is selected, the resulting table specified in the previous example will be as follows:

source: Если функций было больше одной, то к имени добавится окончание, соответствующее выбранной функции.
en: If there is more than one function, the ending corresponding to the selected function will be added to the name.

source: Если функция вызывается без аргументов, то она возвращает метку текущего вычисляемого выражения.
en: If the function is called without arguments, it returns the caption of the current calculated expression.

source: Если хотя бы для одной из управляющих переменных узла задано значение, то в мастере настройки появляются переключатели выбора способа задания значений его параметров:
en: If a value is set for, at least, one of the control node variables, a switch for selection of method used to set values of its parameters will appear in the wizard:

source: Если целевая переменная имеет Переменный тип, то происходит попытка поочерёдно преобразовать исходное строковое значение к типам Логический, Целый, Вещественный и Дата/Время, причём если ни одно из этих преобразований не удалось, то целевая переменная получает строковое значение.
en: If the target varaible is related to the Variable type, there is an attempt to convert alternately the source string value to the Logical, Integer, Real and Date/Time types. In this case, if all these conversions fail, the target variable will get the string value.

source: Если целевая переменная имеет Строковый тип, то преобразование типа данных не выполняется.
en: If the target variable is related to the String type, the data type transformation is not performed.

source: Если целевая переменная имеет тип Логический, Целый, Вещественный или Дата/Время, то исходное строковое значение конвертируется по правилам соответствующего типа, причём для Вещественного типа используется десятичный разделитель .
en: If the target variable refers to the Logical, Integer, Real or Date/Time type, the source string value is converted according to the rules related to corresponding type. In this case, the decimal separator is used for the Real type.

source: Если это стандартная программа Windows:
en: If it is a standard Windows program:

source: Если это сторонняя программа:
en: If it is a third-party program:

source: Если это требование не выполнено, то в момент активации узла будет выдана ошибка.
en: If this requirement is not met, error message will appear when node activating.

source: Есть 2 режима выделения:
en: There are two selection modes:

source: Есть возможность создания собственных SOAP и REST сервисов.
en: It is possible to create own SOAP and REST services.

source: Еще до введения логин/пароль в нижнем левом углу содержится номер версии (типа Loginom X.X.X, где X.X.X – номер версии).
en: There is a version number in the left lower corner before login/password entering (for example, Loginom X.X.X where X.X.X is a version number).

source: Её можно посмотреть в дополнительном окне, нажав кнопку Гистограмма.
en: It can be viewed in the additional window by pressing Histogram button.

source: Жидкость для розжига
en: Fire starter fluid

source: За его настройку отвечает параметр Точность.
en: Precision parameter is required for its configuration.

source: За исключением способа Разность, каждый из перечисленных способов слияния является аналогом определенного типа соединения в языке запросов SQL.
en: With the exception of the Difference method, each of the enumerated join methods is an analogue of the particular join type in SQL.

source: Заглавных или строчных латинских букв;
en: Capital or low case Latin characters.

source: Заголовки столбцов не используются.
en: Columns headers are not used.

source: Заголовок — наименование оси X.
en: Header: name of X axis.

source: Заголовок — наименование оси Y (с левой стороны).
en: Header: name of Y axis (from the left side).

source: Заголовок — наименование оси Y (с правой стороны).
en: Header: name of Y axis (from the right side).

source: Загрузка структуры узлов из XSD схемы
en: Loading of the Nodes Structure from the XSD Schema

source: Задавая минимальную величину лифта, можно отсеять наименее значимые правила.
en: Setting the minimum lift value, it is possible to exclude the least important rules.

source: Задает диапазон от 0 до 100%.
en: It sets the range from 0 to 100%.

source: Задает диапазон от 0 до числа строк в исходном наборе данных.
en: It sets the range from 0 to the row count in the source data set.

source: Задает функциональность данных столбца в контексте выполняемого обработчиком алгоритма.
en: It sets the column data feature in the context of the algorithm executed by the handler.

source: Задается абсолютным путем или относительным (корневой каталог "C:\ProgramData\BaseGroup\Loginom 6\Server").| |Имя файла закрытого ключа||Путь к файлу ключа используемого для SSL-соединения.
en: It is set by the absolute or relative path (root directory "C:\ProgramData\BaseGroup\Loginom 6\Server").| |Private key file name||Path to the key file used for the SSL connection.

source: Задается абсолютным путем или относительным (корневой каталог "C:\ProgramData\BaseGroup\Loginom 6\Server").| |Период проверки соединения (сек.)|300|Временной промежуток между проверкой соединения с клиентом, необходимый для автоматического определения разрыва сетевого соединения и закрытием соответствующей сессии клиента вместе с открытыми в ней пакетами.
en: It is set by the absolute or relative path (root directory "C:\ProgramData\BaseGroup\Loginom 6\Server").| |Connection check period (s)|300|Time interval between check of connection with client that is required for the automatic determination of the network connection loss and closure of the corresponding client session with the packages opened in it.

source: Задается абсолютным путем относительно папки Logs, то есть по умолчанию для серверной версии файл находится в "C:\ProgramData\BaseGroup\Loginom 6\Server\Logs", а для десктопной версии в "C:\Users\User\AppData\Roaming\BaseGroup\Loginom 6\Personal\Logs".| |Перезапись файла|false|Флаг пересоздания файла логирования при запуске приложения, вместо его дополнения.
en: It is set by the absolute path relative to the Logs folder, namely, is located in "C:\ProgramData\BaseGroup\Loginom 6\Server\Logs" by default for the server version the file, and for the desktop version in "C:\Users\User\AppData\Roaming\BaseGroup\Loginom 6\Personal\Logs".| |Rewrite file|false|Checkbox of the logging file recreation while the application start instead of its supplementation.

source: Задается в секундах.
en: It is set in seconds.

source: Задается на языке правил, использующем подмножество регулярных выражений Perl (Perl regular expressions, regex).
en: It is set using the language of rules based on a subset of regular expressions Perl (Perl regular expressions, regex).

source: Задается пользователем
en: It is set by a user

source: Задается шаблоном в мастере настройки
en: It is set using a template in the wizard

source: Задание назначения полей (см.
en: set fields usage types (refer to

source: Задание порядка полей в таблице;
en: Set fields order in the table;

source: Задание структуры узлов вручную
en: Manual Setting of the Nodes Structure

source: Задание цвета через код Hex.
en: Set the color via Hex code.

source: Задание цвета через код RGB.
en: Set the color via RGB code.

source: Заданное значение.
en: Set value.

source: Заданное число кластеров.
en: Set number of clusters.
